In [1]:
import pandas as pd

In [2]:
tras_path = pd.read_csv('Transaction Path.csv')
acc_hold = pd.read_excel('Account Information.xlsx',sheet_name='Account Holders')
acc_info = pd.read_excel('Account Information.xlsx',sheet_name='Account Information')
tras_det = pd.read_csv('Transaction Detail.csv')

In [3]:
print(tras_det.shape)
tras_det.head()

(8781, 4)

   Transaction ID Transaction Date   Value Cancelled?
0         1957155       2023-02-01  128.78          N
1        28234510       2023-02-01  163.82          N
2        33688648       2023-02-01   54.71          N
3        41670299       2023-02-01   88.10          N
4        42825784       2023-02-01  217.22          Y

In [4]:
tras_det = tras_det[tras_det['Cancelled?'] != 'Y']

In [5]:
tras_det

      Transaction ID Transaction Date   Value Cancelled?
0            1957155       2023-02-01  128.78          N
1           28234510       2023-02-01  163.82          N
2           33688648       2023-02-01   54.71          N
3           41670299       2023-02-01   88.10          N
5           57723869       2023-02-01   89.22          N
...              ...              ...     ...        ...
8776      9881408962       2023-02-14   38.18          N
8777      9889326485       2023-02-14  126.71          N
8778      9892097130       2023-02-14  157.43          N
8779      9951297137       2023-02-14  120.16          N
8780      9954545077       2023-02-14  128.56          N

[8689 rows x 4 columns]

In [6]:
acc_info.head()
print(acc_info.shape)

(3000, 5)

In [7]:
acc_info = acc_info[acc_info['Account Type'] != 'Platinum']
acc_info.shape

(2545, 5)

In [8]:
tras_det = tras_det[tras_det['Value'] > 1000]

In [9]:
transaction = tras_det.merge(tras_path,on='Transaction ID')

In [10]:
transaction.head()

,Transaction ID,Transaction Date,Value,Cancelled?,Account_To,Account From
0,205795064,2023-02-01,1152.9,N,86053438,86893452
1,275656446,2023-02-01,1139.7,N,28911002,81655495
2,664959989,2023-02-01,1255.3,N,39402264,70214700
3,826394388,2023-02-01,1089.6,N,71718483,32221652
4,908048920,2023-02-01,1194.4,N,97294152,99729369

In [11]:
acc = acc_hold.merge(acc_info,on='Account Holder ID')

In [12]:
acc.head()

,Account Holder ID,Name,Date of Birth,Contact Number,First Line of Address,Account Number,Account Type,Balance Date,Balance
0,20123998,Maynord Surgeoner,21/08/1997,7716107305,6422 Buena Vista Plaza,10011977,Basic,2023-01-31,676.54
1,97027297,Blake Dudson,30/06/1955,7253587445,2 Huxley Hill,10031238,Basic,2023-01-31,576.52
2,89460366,Kayla Emtage,12/10/1987,7867994451,8 Green Ridge Alley,10079965,Basic,2023-01-31,799.27
3,41402857,Federico Cathro,13/12/1985,7283906757,12 Green Hill,10231977,Basic,2023-01-31,61.63
4,8882143,Kizzee Puddephatt,18/10/2003,7598835878,72404 Maywood Avenue,10232603,Gold,2023-01-31,732.55

In [13]:
#acc.to_csv('acc.csv')
#transaction.to_csv('transaction.csv')

I don't see any related column to join the remaing dataset 
i will wait for the solution and see how they join it